Show / Hide Table of Contents
Class ConnectionInfo
Provides information about connection
Inheritance
System.Object
ConnectionInfo
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Connection
Assembly: IdeaRS.OpenModel.dll
Syntax
[DataContract]
public class ConnectionInfo
Properties
Improve this Doc   View Source
Description
The description of the connection
Declaration
[DataMember]
public string Description { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
Id
The id of the connection
Declaration
[DataMember]
public int Id { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
Identifier
The identifier of the connection
Declaration
[DataMember]
public string Identifier { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
Name
The name of the connection
Declaration
[DataMember]
public string Name { get; set; }
Property Value
 Type |  Description
 System.String
 Improve this Doc
 View Source